A . Data Loading & Cleaning
 
1. Load dataset into a DataFrame.

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("titanic.csv")

2. Display basic info: head(), describe(), info().

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [18]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

3. Handle missing values (drop, fill, or impute ).

In [20]:
# Filling missing values

df["Age"]= df["Age"].fillna(df["Age"].median())
print(df["Age"])

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413    27.0
414    39.0
415    38.5
416    27.0
417    27.0
Name: Age, Length: 418, dtype: float64

In [ ]:
# Drop missing values

df= df.dropna()
print(df)

     PassengerId  Survived  Pclass  \
12           904         1       1
14           906         1       1
24           916         1       1
26           918         1       1
28           920         0       1
..           ...       ...     ...
404         1296         0       1
405         1297         0       2
407         1299         0       1
411         1303         1       1
414         1306         1       1

                                                  Name     Sex   Age  SibSp  \
12       Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female  23.0      1
14   Chaffee, Mrs. Herbert Fuller (Carrie Constance...  female  47.0      1
24     Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  female  48.0      1
26                        Ostby, Miss. Helene Ragnhild  female  22.0      0
28                             Brady, Mr. John Bertram    male  41.0      0
..                                                 ...     ...   ...    ...
404                       Frauenthal, Mr. Isaac Gerald    male  43.0      1
405       Nourney, Mr. Alfred (Baron von Drachstedt")"    male  20.0      0
407                         Widener, Mr. George Dunton    male  50.0      1
411    Minahan, Mrs. William Edward (Lillian E Thorpe)  female  37.0      1
414                       Oliva y Ocana, Dona. Fermina  female  39.0      0

     Parch         Ticket      Fare            Cabin Embarked
12       0          21228   82.2667              B45        S
14       0    W.E.P. 5734   61.1750              E31        S
24       3       PC 17608  262.3750  B57 B59 B63 B66        C
26       1         113509   61.9792              B36        C
28       0         113054   30.5000              A21        S
..     ...            ...       ...              ...      ...
404      0          17765   27.7208              D40        C
405      0  SC/PARIS 2166   13.8625              D38        C
407      1         113503  211.5000              C80        C
411      0          19928   90.0000              C78        Q
414      0       PC 17758  108.9000             C105        C

[91 rows x 12 columns]

In [9]:
# Fix data types

df["Survived"].astype("category")
df["Pclass"].astype("category")
print(df.dtypes)
print(df["Pclass"].dtype)

PassengerId      int64
Survived          bool
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object
int64

In [14]:
pd.to_numeric(df["Fare"],errors='coerce')

0        7.8292
1        7.0000
2        9.6875
3        8.6625
4       12.2875
         ...
413      8.0500
414    108.9000
415      7.2500
416      8.0500
417     22.3583
Name: Fare, Length: 418, dtype: float64

In [13]:
df.drop_duplicates()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,False,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,True,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,False,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,False,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,True,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,False,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,True,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,False,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,False,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,False,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

B. Data Manipulation

1. Filtering rows based on conditions (e.g., age > 30).

In [15]:
df[df["Age"] > 30]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,False,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,True,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,False,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
11,903,False,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
13,905,False,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
404,1296,False,1,"Frauenthal, Mr. Isaac Gerald",male,43.0,1,0,17765,27.7208,D40,C
407,1299,False,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
411,1303,True,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
414,1306,True,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,False,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S

2. Selecting columns & using .loc/ .iloc.

In [16]:
df[["Age" , "Fare" , "Survived"]]

      Age      Fare  Survived
0    34.5    7.8292     False
1    47.0    7.0000      True
2    62.0    9.6875     False
3    27.0    8.6625     False
4    22.0   12.2875      True
..    ...       ...       ...
413   NaN    8.0500     False
414  39.0  108.9000      True
415  38.5    7.2500     False
416   NaN    8.0500     False
417   NaN   22.3583     False

[418 rows x 3 columns]

In [17]:
df.loc[0:10, ["Age", "Fare", "Survived"]]

     Age     Fare  Survived
0   34.5   7.8292     False
1   47.0   7.0000      True
2   62.0   9.6875     False
3   27.0   8.6625     False
4   22.0  12.2875      True
5   14.0   9.2250     False
6   30.0   7.6292      True
7   26.0  29.0000     False
8   18.0   7.2292      True
9   21.0  24.1500     False
10   NaN   7.8958     False

In [18]:
df.iloc[0:5, 0:4]

   PassengerId  Survived  Pclass                                          Name
0          892     False       3                              Kelly, Mr. James
1          893      True       3              Wilkes, Mrs. James (Ellen Needs)
2          894     False       2                     Myles, Mr. Thomas Francis
3          895     False       3                              Wirz, Mr. Albert
4          896      True       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

3. Grouping & Aggregatons:
           . Mean, count, sum, min/mix of relevant columns.

In [19]:
df.groupby("Pclass")["Age"].mean()

Pclass
1    40.918367
2    28.777500
3    24.027945
Name: Age, dtype: float64

In [20]:
df.groupby("Pclass")["PassengerId"].count()

Pclass
1    107
2     93
3    218
Name: PassengerId, dtype: int64

In [21]:
df.groupby("Pclass")["Age"].sum()

Pclass
1    4010.00
2    2532.42
3    3508.08
Name: Age, dtype: float64

In [22]:
df.groupby("Pclass")["Age"].min()

Pclass
1    6.00
2    0.92
3    0.17
Name: Age, dtype: float64

In [23]:
df.groupby("Pclass")["Survived"].max()

Pclass
1    True
2    True
3    True
Name: Survived, dtype: bool

4.  Merging/joining (if dataset has multiple CSVs. or creat a small second dataset and merge them).

In [26]:
bonus_df = pd.DataFrame({
    "Pclass": [1, 2, 3],
    "Class_Name": ["Luxury", "Standard", "Economy"]
})
print(bonus_df)

   Pclass Class_Name
0       1     Luxury
1       2   Standard
2       3    Economy

In [30]:
merged_df = pd.merge(df, bonus_df, on="Pclass", how="left")
merged_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Class_Name
0,892,False,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Economy
1,893,True,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Economy
2,894,False,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Standard
3,895,False,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Economy
4,896,True,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Economy